# Import Pandas

In [3]:
import pandas as pd
import numpy as np
pd.__version__

'2.2.3'

# Pandas Data Structure

In [8]:
s = pd.Series([10,20,30])
print(s)

0    10
1    20
2    30
dtype: int64

In [13]:
df = pd.DataFrame({
    "name":["anitha","suji"],
    "age":[20,20]})
df

     name  age
0  anitha   20
1    suji   20

# Writing the data into files

In [17]:
df.to_csv('data.csv',index=False)

# Reading data(CSV)

In [25]:
df=pd.read_csv(r"C:\Users\ASUS\data.csv")
df

        city  Temp  Humidity condition
0   Kakinada    87        65     sunny
1      Vizag    97        65     rainy
2        Hyd    65        67    cloudy
3  vijaywada    45        45     sunny
4    chennai    74        67     sunny
5   Benglore    34        64    cloudy
6     Mumbai    23        43    cloudy

# Exploring Data

In [26]:
df.head()

        city  Temp  Humidity condition
0   Kakinada    87        65     sunny
1      Vizag    97        65     rainy
2        Hyd    65        67    cloudy
3  vijaywada    45        45     sunny
4    chennai    74        67     sunny

In [27]:
df.tail()

        city  Temp  Humidity condition
2        Hyd    65        67    cloudy
3  vijaywada    45        45     sunny
4    chennai    74        67     sunny
5   Benglore    34        64    cloudy
6     Mumbai    23        43    cloudy

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   city       7 non-null      object
 1   Temp       7 non-null      int64
 2   Humidity   7 non-null      int64
 3   condition  7 non-null      object
dtypes: int64(2), object(2)
memory usage: 356.0+ bytes

In [37]:
df['city'][df['condition']=='Rainy']

Series([], Name: city, dtype: object)

In [31]:
df.shape

(7, 4)

In [32]:
df[2:5]

        city  Temp  Humidity condition
2        Hyd    65        67    cloudy
3  vijaywada    45        45     sunny
4    chennai    74        67     sunny

# slicing

In [33]:
df.columns

Index(['city', 'Temp', 'Humidity', 'condition'], dtype='object')

In [34]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [35]:
df.dtypes

city         object
Temp          int64
Humidity      int64
condition    object
dtype: object

In [38]:
df.city

0     Kakinada
1        Vizag
2          Hyd
3    vijaywada
4      chennai
5     Benglore
6       Mumbai
Name: city, dtype: object

In [43]:
df['city']

0     Kakinada
1        Vizag
2          Hyd
3    vijaywada
4      chennai
5     Benglore
6       Mumbai
Name: city, dtype: object

In [41]:
df[['city','Humidity']]

        city  Humidity
0   Kakinada        65
1      Vizag        65
2        Hyd        67
3  vijaywada        45
4    chennai        67
5   Benglore        64
6     Mumbai        43

#  Missing value

In [42]:
df.isnull()

    city   Temp  Humidity  condition
0  False  False     False      False
1  False  False     False      False
2  False  False     False      False
3  False  False     False      False
4  False  False     False      False
5  False  False     False      False
6  False  False     False      False

In [1]:
df = pd.DataFrame({
    "name":["lavs","hanna","anu"],
    "age":[25,23,None]
})
df

NameError: name 'pd' is not defined

In [45]:
df.isnull()

    name    age
0  False  False
1  False  False
2  False   True

In [46]:
df.isnull().sum()

name    0
age     1
dtype: int64

In [49]:
df[df.isnull().any(axis=1)]

  name  age
2  anu  NaN

In [50]:
df['age'] = df['age'].fillna(df['age'].mean())

In [51]:
df

   name   age
0  lavs  25.0
1  mini  23.0
2   anu  24.0

In [52]:
df_clean = df.dropna()

In [53]:
df_clean

   name   age
0  lavs  25.0
1  mini  23.0
2   anu  24.0

# Duplicates

In [63]:
df = pd.DataFrame({
    "name":["mini","anu","mini"],
    "age":[23,25,23]
})
df

   name  age
0  mini   23
1   anu   25
2  mini   23

In [64]:
df.duplicated()

0    False
1    False
2     True
dtype: bool

In [65]:
df[df.duplicated()]

   name  age
2  mini   23

In [66]:
df = df.drop_duplicates()
df

   name  age
0  mini   23
1   anu   25